# 42.4

age = float(input())  
sex = input()


# Да се напише конзолна програма, която прочита възраст (реално число) и пол
# ('m' или 'f'), въведени от потребителя, и отпечатва обръщение измежду следните:
#     • "Mr." – мъж (пол 'm') на 16 или повече години
#     • "Master" – момче (пол 'm') под 16 години
#     • "Ms." – жена (пол 'f') на 16 или повече години
#     • "Miss" – момиче (пол 'f') под 16 години


if age >= 16 and sex == 'm':
    print('Mr.')
elif age < 16 and sex == 'm':
    print('Master')

if age >= 16 and sex == 'f':
        print('Ms.')
elif age < 16 and sex == 'f':
        print('Miss')
